challengerBack001/app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "follow" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["follow", 1], ["updated_at", "2022-11-23 13:15:43.781345"], ["id", 5]]